ben/blog/2025-09-12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Journal for the week of Sep 12th 2025</title>
<meta name="author" content="Ben" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Journal for the week of Sep 12th 2025</h1>
<p><strong>Tags:</strong> <span class="tags"><a href="tags/meta.html">meta</a> <a href="tags/languages.html">languages</a> <a href="tags/journal.html">journal</a></span></p>

<div id="outline-container-orgeae7868" class="outline-2">
<h2 id="orgeae7868">Quote of the Week</h2>
<div class="outline-text-2" id="text-orgeae7868">
<p>
"Foul deeds will rise, though all the earth overwhelm them, to men's eyes."
</p>

<p>
<i>- Hamlet</i>
</p>
</div>
</div>
<div id="outline-container-orga55b387" class="outline-2">
<h2 id="orga55b387">Work</h2>
<div class="outline-text-2" id="text-orga55b387">
<p>
My manager gave me "feedback" from another manager about a project I'm working on. This project has taken longer than expected so I understand why they're unhappy about it. I'm irked that the dev I'm working with didn't being it up to me earlier. I guess it's just escalating through management, which makes sense, though I feel like I'm mature enough that I could take individual feedback and not have it affect our working relationship.
</p>

<p>
It's also tough because I've already been working evenings and weekends to get this project completed. I should've escalated to my manager earlier when I was running into issues. I thought I could figure it out and didn't think there was much my manager could do anyway, but knowing about would've helped.
</p>
</div>
</div>
<div id="outline-container-org081d4f1" class="outline-2">
<h2 id="org081d4f1">Personal</h2>
<div class="outline-text-2" id="text-org081d4f1">
<p>
I'm reading Hamlet for fun and really enjoying it. I don't have much experience reading Shakespeare, so it has been a nice change of pace.
</p>
</div>
</div>
<div id="outline-container-org816b0cb" class="outline-2">
<h2 id="org816b0cb">Spanish</h2>
<div class="outline-text-2" id="text-org816b0cb">
<p>
I've been practicing nightly with Duolingo. I also play soccer with a lot of people who speak Spanish but I'm nervous when speaking and put a lot of pressure on myself which causes me to forget how to say things. I have this expectation that I need to be be able to speak quickly and clearly and if not people will be annoyed with me.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-09-12</p>
<p class="author">Author: Ben</p>
</div>
</body>
</html>
